app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "user_name", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "It's my comment"], ["user_name", "Kolan4ick"], ["post_id", 35], ["created_at", "2020-12-20 10:33:52.342105"], ["updated_at", "2020-12-20 10:33:52.342105"]]
---
  def create
    params[:comment][:post_id] = params[:post_id]
    comment = Comment.create(comments_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]
---
  def destroy
    post = Post.find(params[:post_id])