app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Друга стаття"], ["body", "Текст другої статті"], ["created_at", "2020-12-20 12:15:28.007661"], ["updated_at", "2020-12-20 12:15:28.007661"]]
---
  def create
    post = Post.create(post_params)

UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2020-12-20 12:08:18.974766"], ["id", 33]]
---
  def update
    post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 35]]
---
  def destroy
    post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def post
    @post ||= Post.find(params[:id])